MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK10DN512VLL10/mcu.h
#define Error Access Control Detail   0x7FFF80000000      // Indicates the region descriptor with the access error.
#define This field is reserved.       0x007F8000      // This read-only field is reserved and always has the value 0.
#define Error Master Number           0x00000780      // Indicates the bus master that generated the access error.
#define Error Attributes              0x00000038      // Indicates attribute information about the faulting reference.
#define Error Read/Write              0x00000001      // Indicates the access type of the faulting reference.


//*****************************************************************************
//
// The following are defines for the bit fields in the MPU_RGDn_WORD0 register.
//
//*****************************************************************************

#define Start Address                 0x3FFFFFF80000000      // Defines the most significant bits of the 0-modulo-32 byte start address of the memory region.
#define This field is reserved.       0x000001F0      // This read-only field is reserved and always has the value 0.


//*****************************************************************************
//
// The following are defines for the bit fields in the MPU_RGDn_WORD1 register.
//
//*****************************************************************************

#define End Address                   0x3FFFFFF80000000      // Defines the most significant bits of the 31-modulo-32 byte end address of the memory region.
#define This field is reserved.       0x000001F0      // This read-only field is reserved and always has the value 1.


//*****************************************************************************
//
// The following are defines for the bit fields in the MPU_RGDn_WORD2 register.
//
//*****************************************************************************

#define Bus Master 7 Read Enable      0x80000000      // 0: Bus master 7 reads terminate with an access error and the read is not performed;; 1: Bus master 7 reads allowed
#define Bus Master 7 Write Enable     0x40000000      // 0: Bus master 7 writes terminate with an access error and the write is not performed;; 1: Bus master 7 writes allowed
#define Bus Master 6 Read Enable      0x20000000      // 0: Bus master 6 reads terminate with an access error and the read is not performed;; 1: Bus master 6 reads allowed
#define Bus Master 6 Write Enable     0x10000000      // 0: Bus master 6 writes terminate with an access error and the write is not performed;; 1: Bus master 6 writes allowed
#define Bus Master 5 Read Enable      0x08000000      // 0: Bus master 5 reads terminate with an access error and the read is not performed;; 1: Bus master 5 reads allowed
#define Bus Master 5 Write Enable     0x04000000      // 0: Bus master 5 writes terminate with an access error and the write is not performed;; 1: Bus master 5 writes allowed
#define Bus Master 4 Read Enable      0x02000000      // 0: Bus master 4 reads terminate with an access error and the read is not performed;; 1: Bus master 4 reads allowed
#define Bus Master 4 Write Enable     0x01000000      // 0: Bus master 4 writes terminate with an access error and the write is not performed;; 1: Bus master 4 writes allowed
#define This field is reserved.       0x00800000      // This bit must be written with a zero.
#define Bus Master 3 Supervisor Mode Access Control0x00C00000      // 00: r/w/x; read, write and execute allowed;; 01: r/x; read and execute allowed, but no write;; 10: r/w; read and write allowed, but no execute;; 11: Same as User mode defined in M3UM
#define Bus Master 3 User Mode Access Control0x00700000      // 0: An attempted access of that mode may be terminated with an access error (if not allowed by another descriptor) and the access not performed;; 1: Allows the given access type to occur
#define This field is reserved.       0x00020000      // This bit must be written with a zero.
#define Bus Master 2 Supervisor Mode Access Control0x00030000      // See M3SM description.
#define Bus Master 2 User Mode Access control0x0001C000      // See M3UM description.
#define This field is reserved.       0x00000800      // This bit must be written with a zero.
#define Bus Master 1 Supervisor Mode Access Control0x00000C00      // See M3SM description.
#define Bus Master 1 User Mode Access Control0x00000700      // See M3UM description.
#define This field is reserved.       0x00000020      // This bit must be written with a zero.
#define Bus Master 0 Supervisor Mode Access Control0x00000030      // See M3SM description.
#define Bus Master 0 User Mode Access Control0x0000001C      // See M3UM description.


//*****************************************************************************
//
// The following are defines for the bit fields in the MPU_RGDn_WORD3 register.
//
//*****************************************************************************

#define This field is reserved.       0x3FFFFFFF80000000      // This read-only field is reserved and always has the value 0.
#define Valid                         0x00000001      // Signals the region descriptor is valid. Any write to RGDn_WORD0–2 clears this bit.


//*****************************************************************************
//
// The following are defines for the bit fields in the MPU_RGDAACn register.
//
//*****************************************************************************

#define Bus Master 7 Read Enable      0x80000000      // 0: Bus master 7 reads terminate with an access error and the read is not performed;; 1: Bus master 7 reads allowed
#define Bus Master 7 Write Enable     0x40000000      // 0: Bus master 7 writes terminate with an access error and the write is not performed;; 1: Bus master 7 writes allowed
#define Bus Master 6 Read Enable      0x20000000      // 0: Bus master 6 reads terminate with an access error and the read is not performed;; 1: Bus master 6 reads allowed
#define Bus Master 6 Write Enable     0x10000000      // 0: Bus master 6 writes terminate with an access error and the write is not performed;; 1: Bus master 6 writes allowed
#define Bus Master 5 Read Enable      0x08000000      // 0: Bus master 5 reads terminate with an access error and the read is not performed;; 1: Bus master 5 reads allowed
#define Bus Master 5 Write Enable     0x04000000      // 0: Bus master 5 writes terminate with an access error and the write is not performed;; 1: Bus master 5 writes allowed
#define Bus Master 4 Read Enable      0x02000000      // 0: Bus master 4 reads terminate with an access error and the read is not performed;; 1: Bus master 4 reads allowed
#define Bus Master 4 Write Enable     0x01000000      // 0: Bus master 4 writes terminate with an access error and the write is not performed;; 1: Bus master 4 writes allowed
#define This field is reserved.       0x00800000      // This bit must be written with a zero.
#define Bus Master 3 Supervisor Mode Access Control0x00C00000      // See M3SM description.
#define Bus Master 3 User Mode Access Control0x00700000      // See M3UM description.
#define This field is reserved.       0x00020000      // This bit must be written with a zero.
#define Bus Master 2 Supervisor Mode Access Control0x00030000      // See M3SM description.
#define Bus Master 2 User Mode Access control0x0001C000      // See M3UM description.
#define This field is reserved.       0x00000800      // This bit must be written with a zero.
#define Bus Master 1 Supervisor Mode Access Control0x00000C00      // See M3SM description.
#define Bus Master 1 User Mode Access Control0x00000700      // See M3UM description.
#define This field is reserved.       0x00000020      // This bit must be written with a zero.
#define Bus Master 0 Supervisor Mode Access Control0x00000030      // See M3SM description.
#define Bus Master 0 User Mode Access Control0x0000001C      // See M3UM description.


//*****************************************************************************
//
// The following are defines for the bit fields in the AIPSx_MPRA register.
//
//*****************************************************************************

#define MTR0                          0x40000000      // Master Trusted For Read
#define MTW0                          0x20000000      // Master Trusted For Writes
#define MPL0                          0x10000000      // Master Privilege Level
#define MTR1                          0x04000000      // Master trusted for read
#define MTW1                          0x02000000      // Master trusted for writes
#define MPL1                          0x01000000      // Master privilege level
#define MTR2                          0x00400000      // Master Trusted For Read
#define MTW2                          0x00200000      // Master Trusted For Writes
#define MPL2                          0x00100000      // Master Privilege Level
#define MTR3                          0x00040000      // Master Trusted For Read
#define MTW3                          0x00020000      // Master Trusted For Writes
#define MPL3                          0x00010000      // Master Privilege Level
#define MTR4                          0x00004000      // Master Trusted For Read
#define MTW4                          0x00002000      // Master Trusted For Writes
#define MPL4                          0x00001000      // Master Privilege Level
#define MTR5                          0x00000400      // Master Trusted For Read
#define MTW5                          0x00000200      // Master Trusted For Writes
#define MPL5                          0x00000100      // Master Privilege Level


//*****************************************************************************
//
// The following are defines for the bit fields in the AIPSx_PACRn register.
//
//*****************************************************************************

