MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK10DN512VLL10/mcu.h
#define RPLOFIE                       0x00000004      // Receive Packet Length Overflow Interrupt Enable
#define CTXDIE                        0x00000002      // Collision during transmission of byte sync or later packet Interrupt Enable
#define CPTXIE                        0x00000001      // Collision during preamble transmission Interrupt Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_SDTH register.
//
//*****************************************************************************

#define SDTH                          0x00007F80      // Secondary Delay Timer High


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_SDTL register.
//
//*****************************************************************************

#define SDTL                          0x00007F80      // Secondary Delay Timer Low


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_PRE register.
//
//*****************************************************************************

#define PREAMBLE                      0x00007F80      // CEA709.1-B Preamble Register


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_TPL register.
//
//*****************************************************************************

#define TPL                           0x00007F80      // Transmit Packet Length Register


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_IE register.
//
//*****************************************************************************

#define PEIE                          0x00000080      // Preamble Error Interrupt Enable
#define WBEIE                         0x00000040      // WBASE Expired Interrupt Enable
#define ISDIE                         0x00000020      // Initial Sync Detection Interrupt Enable
#define PRXIE                         0x00000010      // Packet Received Interrupt Enable
#define PTXIE                         0x00000008      // Packet Transmitted Interrupt Enable
#define PCTEIE                        0x00000004      // Packet Cycle Timer Interrupt Enable
#define PSIE                          0x00000002      // Preamble Start Interrupt Enable
#define TXDIE                         0x00000001      // Transmission Delay Interrupt Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_WB register.
//
//*****************************************************************************

#define WBASE                         0x00007F80      // CEA709.1-B WBASE register


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_S3 register.
//
//*****************************************************************************

#define PEF                           0x00000080      // Preamble Error Flag
#define WBEF                          0x00000040      // Wbase Expired Flag
#define ISD                           0x00000020      // Initial Sync Detect
#define PRXF                          0x00000010      // Packet Received Flag
#define PTXF                          0x00000008      // Packet Transmitted Flag
#define PCTEF                         0x00000004      // Packet Cycle Timer Expired Flag
#define PSF                           0x00000002      // Preamble Start Flag
#define TXFF                          0x00000001      // Transmission Fail Flag


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_S4 register.
//
//*****************************************************************************

#define LNF                           0x00000020      // LON Noise Flag
#define RPLOF                         0x00000010      // Received Packet Length Overflow Flag
#define CDET                          0x00000018      // CDET
#define TXDF                          0x00000002      // Transmission Delay Flag
#define FE                            0x00000001      // Framing Error


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_RPL register.
//
//*****************************************************************************

#define RPL                           0x00007F80      // Received Packet Length


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_RPREL register.
//
//*****************************************************************************

#define RPREL                         0x00007F80      // Received Preamble Length


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_CPW register.
//
//*****************************************************************************

#define CPW                           0x00007F80      // CEA709.1-B CPW register
#define CPW                           0x00007F80      // CEA709.1-B CPW register


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_RIDTH register.
//
//*****************************************************************************

#define RIDTH                         0x00007F80      // CEA709.1-B Receive IDT register High
#define RIDTH                         0x00007F80      // CEA709.1-B Receive IDT register High


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_RIDTL register.
//
//*****************************************************************************

#define RIDTL                         0x00007F80      // CEA709.1-B Receive IDT register Low
#define RIDTL                         0x00007F80      // CEA709.1-B Receive IDT register Low


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_TIDTH register.
//
//*****************************************************************************

#define TIDTH                         0x00007F80      // CEA709.1-B Transmit IDT Register High
#define TIDTH                         0x00007F80      // CEA709.1-B Transmit IDT Register High


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_TIDTL register.
//
//*****************************************************************************

#define TIDTL                         0x00007F80      // CEA709.1-B Transmit IDT Register Low
#define TIDTL                         0x00007F80      // CEA709.1-B Transmit IDT Register Low


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_RB1TH register.
//
//*****************************************************************************

#define RB1TH                         0x00007F80      // Receive Beta1 Timer High
#define RB1TH                         0x00007F80      // Receive Beta1 Timer High


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_RB1TL register.
//
//*****************************************************************************

#define RB1TL                         0x00007F80      // Receive Beta1 Timer Low
#define RB1TL                         0x00007F80      // Receive Beta1 Timer Low


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_TB1TH register.
//
//*****************************************************************************

#define TB1TH                         0x00007F80      // Transmit Beta1 Timer High
#define TB1TH                         0x00007F80      // Transmit Beta1 Timer High


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_TB1TL register.
//
//*****************************************************************************

#define TB1TL                         0x00007F80      // Transmit Beta1 Timer Low
#define TB1TL                         0x00007F80      // Transmit Beta1 Timer Low


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_PROG_REG register.
//
//*****************************************************************************

#define LCV_LEN                       0x00000780      // Line Code violation length
#define MIN_DMC1                      0x00000078      // Minimum DMC-1s
#define LCV_LEN                       0x00000780      // Line Code violation length
#define MIN_DMC1                      0x00000078      // Minimum DMC-1s


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_STATE_REG register.
//
//*****************************************************************************

#define TX_STATE                      0x000000E0      // LON TX State
#define SM_STATE                      0x0000001C      // LON SM State ::


//*****************************************************************************
//
// The following are defines for the bit fields in the SDHC_DSADDR register.
//
//*****************************************************************************

#define DSADDR                        0x1FFFFFFF80000000      // DMA System Address


//*****************************************************************************
//
// The following are defines for the bit fields in the SDHC_BLKATTR register.
//
//*****************************************************************************

#define BLKCNT                        0x7FFF80000000      // Blocks Count For Current Transfer
#define BLKSIZE                       0x01FFF000      // Transfer Block Size


//*****************************************************************************
//
// The following are defines for the bit fields in the SDHC_CMDARG register.
//
//*****************************************************************************

